import math
print("ИНДИВИДУАЛЬНЫЙ ВАРИАНТ")

print("")
print("ОПРЕДЕЛЕНИЕ ПАРАМЕТРОВ ОСНОВНЫХ ЭЛЕМЕНТОВ ЗЕМНОГО ЭЛЛИПСОИДА И ДЕКАРТОВЫХ КООРДИНАТ ТОЧКИ ЕГО ПОВЕРХНОСТИ");
print("---------------------------------------------------------------------------------------------------------------------")
print("Значения исходных параметров элемнентов эллипсоида")
print("")
print("   а                  6378511.67")
print("   b                  6358218.05")
print("")
print("Криволинейные координаты точки поверхности для варианта 12, где 12-номер варианта")
print("Широта B = 51° 30' 21.600''")
print("Долгота L = 35° 20' 51,600''")
print("---------------------------------------------------------------------------------------------------------------------")

print("Вариант 12");
print("введите параметр a (большая полуось)");
a=float(input ("a="))
print("введите параметр b (малая полуось)");
b=float(input ("b="))  

print("---------------------------------------------------------------------------------------------------------------------")
print("");
print("ЗАДАНИЕ 1. ЗНАЧЕНИЯ ПАРАМЕТРОВ ОСНОВНЫХ ЭЛИМЕНТОВ ЭЛИПСОИДА Красовского, WGS-84, ПЗ-90")
print("");
al=1-(b/a)
print("1)Знчение малой полуоси: al = (1-b/a) = %.4f" %al);
e1=al*(2-al)
print("2)Квадрат значения первого эксцентриситета: e^2 = al(2-al) = %.10f" %e1);
e2=e1/(1-e1)
print("3)Квадрат значения второго эксцентриситета: (e^1)^2 = e^2/(1-e^2) = %.10f" %e2);
c=a*a/b
print("4)Значение полярного радиуса кривизны: с = a^2/b = %.4f" %c);
print("")
print("Контроли:");
print("1)")
b2=b*b
b22=a*a*(1-e1)
print("b^2 = %0.4f" %b2);
print("b^2 = a(1-e^2) = %0.4f" %b22);
print("2)")
b1=a*a/c
print("b =a^2/c = %0.4f" %b1);
print("b = %0.4f" %b);
print("3)")

a_2=a*a
b_2=b*b
p=(a_2-b_2)
e12=p/a_2
print("e^2 = %0.10f" %e1);
print("e^2 = (a^2-b^2)/a^2 = %0.10f" %e12);
print("4)")
a_2=a*a
b_2=b*b
p=(a_2-b_2)
e22=p/b_2
print("(e^1)^2= %0.10f" %e2);
print("(e^1)^2 = (a^2-b^2)/b^2 = %0.10f" %e22);
print("5)")
al1=(a-b)/a
al2=1-math.sqrt(1-e1)
print("al = (a-b)/a = %0.4f" %al1);
print("al = 1-(1-e^2)^(1/2) = %0.4f" %al1);
print("al= %0.4f" %al);
print("6)")
ab=a*al
ab1=a-b
print("a-b = a*al = %0.4f" %ab);
print("a-b = %0.4f" %ab1);
print("7)")
c1=a/(1-al)
print("c = %0.4f" %c);
print("c = a/(1-al) %0.4f" %c1);

print("---------------------------------------------------------------------------------------------------------------------")
print("");
print("ЗАДАНИЕ 2. ЗНАЧЕНИЯ ОСНОВНЫХ(1Й И 2Й) СФЕРИЧЕСКИХ ФУНКЦИЙ (W И V) ГЕОДЕЗИЧЕСКОЙ ШИРОТЫ В")
print("");
B=50.506
Br=B*math.pi/180

sin=math.sin(Br)
cos=math.cos(Br)
#print("sinB= %0.10f" %sin);
#print("cosB= %0.10f" %cos);

sin2=sin*sin
cos2=cos*cos
#print("sinB=%0.10f" %sin2);
#print("cosB=%0.10f" %cos2);

sine=sin2*e1
cose=cos2*e2

w=(1-sine)
print("W^2 = (1-e^2*(sinB)^2 = %0.10f" %w);

cose=cos2*e2
v=(1+cose)
print("V^2 = (1+(e^1)^2*(cosB)^2 = %0.10f" %v);
print("");
print("Контроль:");
print("1)")
aw=a*math.sqrt(w)
bv=b*math.sqrt(v)
print("aW = %0.4f" %aw);
print("bV = %0.4f" %bv);
v=math.sqrt(v)
w=math.sqrt(w)
print("---------------------------------------------------------------------------------------------------------------------")
print("");
print("ЗАДАНИЕ 3. ЗНАЧЕНИЯ ГЛАВНЫХ РАДИУСОВ КРИВИЗНЫ ГЛАВНЫХ НОРМАЛЬНЫХ СЕЧЕНИЙ И СРЕДНЕГО РАДИУСА КРИВИЗНЫ:МЕДИАНА - М, ПЕРВОГОВЕРТИКАЛА - N, РАДИУСА КРИВИЗНЫ - R: ")
print("");
v3=v*v*v
m=c/v3
print("Медиана M =c/V^3 = %0.4f" %m);
n=c/v
print("Первый вертикал N = c/V = %0.4f" %n);
n1=a/w
print("Первый вертикал N = a/W = %0.4f" %n1);
sq=math.sqrt(1-e1*sin*sin)
n2=a/sq
print("Первый вертикал N = a/(1-(e)^2*(sinB)^2)^(1/2) %0.4f" %n2);
r=math.sqrt(m*n)
print("Радиус кривизны R = (N*M)^(1/2) %0.4f" %r);
print("");
print("Контроль:");
print("1)")
nm=n/m
v2=v*v
print("N/M = %0.4f" %nm);
print("V^2 = %0.4f" %v2);
print("---------------------------------------------------------------------------------------------------------------------")
print("");
print("ЗАДАНИЕ 4. ЗНАЧЕНИЯ ДЕКАРТОВЫХ КООРДИНАТ ЗАДАННОЙ ТОЧКИ ПОВЕРХНОСТИ ЭЛЛИПСОИДА, ИСПОЛЬЗУЯ ПАРАМЕТРИЧЕСКИЕ УРАВНЕНИЯ ПОВЕРХНОСТИ ЭЛИПСОИДА: ")
print("");
tg=sin/cos
#print("tg = %0.10f" %tg)
t=math.sqrt(1-e1)
tgu=t*tg
#print("tg u= %0.10f" %tgu)
ur=math.atan(tgu)
u=math.degrees(ur)
#print("u= %0.10f" %u)


L=35.3476
Lr=L*math.pi/180
sinL=math.sin(Lr)
cosL=math.cos(Lr)
#print("sinL= %0.10f" %sinL);
#print("cosL= %0.10f" %cosL);

#Ur=ur
Ur=u*math.pi/180
sinU=math.sin(Ur)
cosU=math.cos(Ur)
#print("sinU= %0.10f" %sinU);
#print("cosU= %0.10f" %cosU);
x=a*cosU*cosL
y=a*cosU*sinL
z=b*sinU

print("x = a*cosU*cosL = %0.4f" %x);
print("y = a*cosU*sinL = %0.4f" %y);
print("z = b*sinU %0.4f" %z);
print("где U - приведенная широта: tgU = (1-e^2)^(1/2)*tgB");
print("Контроли:");

print("1)")
print("x = %0.4f" %x);
x1=n*cos*cosL
print("x = N*cos*cosL = %0.4f" %x1);

print("2)")
print("y = %0.4f" %y);
y1=n*cos*sinL
print("y = N*cos*sinL = %0.4f" %y1);

print("3)")
print("z = %0.4f" %z);
z1=n*(1-e1)*sin
print("z = N*(1-e1)*sin = %0.4f" %z1);

print("")

k=0
while k<3:
    print("ЭЛЛИПСОИДЫ КРАСОВСКОГО, WGS-84, ПЗ-90 (расчет параметров производится по очереди)")
    print("")
    print("ОПРЕДЕЛЕНИЕ ПАРАМЕТРОВ ОСНОВНЫХ ЭЛЕМЕНТОВ ЗЕМНОГО ЭЛЛИПСОИДА И ДЕКАРТОВЫХ КООРДИНАТ ТОЧКИ ЕГО ПОВЕРХНОСТИ");
    print("---------------------------------------------------------------------------------------------------------------------")
    print("ДАНО")
    print("Значения исходных параметров элемнентов эллипсоида")
    print("")
    print("                 Красовского                WGS-84                     ПЗ-90           ")
    print("   а (м)          6378245                   6378137                   6378136          ")
    print("   al             1:298.3                   1:298.25                1:298.257839          ")

    print("")
    print("Криволинейные координаты точки поверхности по вариантам n, где n-номер варианта")
    print("Широта B = 55° 10' 00.000''+30*n'")
    print("Долгота L = 37° 30' 00.000''")
    print("---------------------------------------------------------------------------------------------------------------------")

    print("введите вариант");
    m=float(input ("n="))
    print("введите параметр a (полуось, м)");
    a=float(input ("a="))
    print("введите знаменатель параметра aльфа(сжатие)");
    al=float(input ("al="))  

    print("---------------------------------------------------------------------------------------------------------------------")
    print("");
    print("ЗАДАНИЕ 1. ЗНАЧЕНИЯ ПАРАМЕТРОВ ОСНОВНЫХ ЭЛИМЕНТОВ ЭЛИПСОИДА Красовского, WGS-84, ПЗ-90")
    print("");
    al=1/al
    b=a*(1-al)
    print("1)Знчение малой полуоси, м: b = a(1-al) = %.4f" %b);
    e1=al*(2-al)
    print("2)Квадрат значения первого эксцентриситета: e^2 = al(2-al) = %.10f" %e1);
    e2=e1/(1-e1)
    print("3)Квадрат значения второго эксцентриситета: (e^1)^2 = e^2/(1-e^2) = %.10f" %e2);
    c=a*a/b
    print("4)Значение полярного радиуса кривизны, м: с = a^2/b = %.4f" %c);
    print("")
    print("Контроли:");
    print("1)")
    b2=b*b
    b22=a*a*(1-e1)
    print("b^2, м^2 = %0.4f" %b2);
    print("b^2? м^2 = a(1-e^2) = %0.4f" %b22);
    print("2)")
    b1=a*a/c
    print("b, м = a^2/c = %0.4f" %b1);
    print("b, м = %0.4f" %b);
    print("3)")

    a_2=a*a
    b_2=b*b
    p=(a_2-b_2)
    e12=p/a_2
    print("e^2 = %0.10f" %e1);
    print("e^2 = (a^2-b^2)/a^2 = %0.10f" %e12);
    print("4)")
    a_2=a*a
    b_2=b*b
    p=(a_2-b_2)
    e22=p/b_2
    print("(e^1)^2= %0.10f" %e2);
    print("(e^1)^2 = (a^2-b^2)/b^2 = %0.10f" %e22);
    print("5)")
    al1=(a-b)/a
    al2=1-math.sqrt(1-e1)
    print("al = (a-b)/a = %0.4f" %al1);
    print("al = 1-(1-e^2)^(1/2) = %0.4f" %al1);
    print("al = %0.4f" %al);
    print("6)")
    ab=a*al
    ab1=a-b
    print("a-b, м = a*al = %0.4f" %ab);
    print("a-b, м = %0.4f" %ab1);
    print("7)")
    c1=a/(1-al)
    print("c, м = %0.4f" %c);
    print("c, м = a/(1-al) %0.4f" %c1);

    print("---------------------------------------------------------------------------------------------------------------------")
    print("");
    print("ЗАДАНИЕ 2. ЗНАЧЕНИЯ ОСНОВНЫХ(1Й И 2Й) СФЕРИЧЕСКИХ ФУНКЦИЙ (W И V) ГЕОДЕЗИЧЕСКОЙ ШИРОТЫ В")
    print("");
    B1=198600+1800*m
    B=B1/3600
    Br=B*math.pi/180

    sin=math.sin(Br)
    cos=math.cos(Br)
    #print("sinB= %0.10f" %sin);
    #print("cosB= %0.10f" %cos);

    sin2=sin*sin
    cos2=cos*cos
    #print("sinB=%0.10f" %sin2);
    #print("cosB=%0.10f" %cos2);

    sine=sin2*e1
    cose=cos2*e2

    w=(1-sine)
    print("W^2 = (1-e^2*(sinB)^2 = %0.10f" %w);

    cose=cos2*e2
    v=(1+cose)
    print("V^2 = (1+(e^1)^2*(cosB)^2 = %0.10f" %v);
    print("");
    print("Контроль:");
    print("1)")
    aw=a*math.sqrt(w)
    bv=b*math.sqrt(v)
    print("aW = %0.4f" %aw);
    print("bV = %0.4f" %bv);
    v=math.sqrt(v)
    w=math.sqrt(w)
    print("---------------------------------------------------------------------------------------------------------------------")
    print("");
    print("ЗАДАНИЕ 3. ЗНАЧЕНИЯ ГЛАВНЫХ РАДИУСОВ КРИВИЗНЫ ГЛАВНЫХ НОРМАЛЬНЫХ СЕЧЕНИЙ И СРЕДНЕГО РАДИУСА КРИВИЗНЫ:МЕДИАНА - М, ПЕРВОГОВЕРТИКАЛА - N, РАДИУСА КРИВИЗНЫ - R: ")
    print("");
    v3=v*v*v
    m=c/v3
    print("Медиана M =c/V^3 = %0.4f" %m);
    n=c/v
    print("Первый вертикал N = c/V = %0.4f" %n);
    n1=a/w
    print("Первый вертикал N = a/W = %0.4f" %n1);
    sq=math.sqrt(1-e1*sin*sin)
    n2=a/sq
    print("Первый вертикал N = a/(1-(e)^2*(sinB)^2)^(1/2) %0.4f" %n2);
    r=math.sqrt(m*n)
    print("Радиус кривизны R = (N*M)^(1/2) %0.4f" %r);
    print("");
    print("Контроль:");
    print("1)")
    nm=n/m
    v2=v*v
    print("N/M = %0.4f" %nm);
    print("V^2 = %0.4f" %v2);
    print("---------------------------------------------------------------------------------------------------------------------")
    print("");
    print("ЗАДАНИЕ 4. ЗНАЧЕНИЯ ДЕКАРТОВЫХ КООРДИНАТ ЗАДАННОЙ ТОЧКИ ПОВЕРХНОСТИ ЭЛЛИПСОИДА, ИСПОЛЬЗУЯ ПАРАМЕТРИЧЕСКИЕ УРАВНЕНИЯ ПОВЕРХНОСТИ ЭЛИПСОИДА: ")
    print("");
    tg=sin/cos
    #print("tg = %0.10f" %tg)
    t=math.sqrt(1-e1)
    tgu=t*tg
    #print("tg u= %0.10f" %tgu)
    ur=math.atan(tgu)
    u=math.degrees(ur)
    #print("u= %0.10f" %u)

    L1=2250
    L=L1/60
    Lr=L*math.pi/180
    sinL=math.sin(Lr)
    cosL=math.cos(Lr)
    #print("sinL= %0.10f" %sinL);
    #print("cosL= %0.10f" %cosL);

    #Ur=ur
    Ur=u*math.pi/180
    sinU=math.sin(Ur)
    cosU=math.cos(Ur)
    #print("sinU= %0.10f" %sinU);
    #print("cosU= %0.10f" %cosU);
    x=a*cosU*cosL
    y=a*cosU*sinL
    z=b*sinU

    print("x = a*cosU*cosL = %0.4f" %x);
    print("y = a*cosU*sinL = %0.4f" %y);
    print("z = b*sinU %0.4f" %z);
    print("где U - приведенная широта: tgU = (1-e^2)^(1/2)*tgB");
    print("Контроли:");

    print("1)")
    print("x = %0.4f" %x);
    x1=n*cos*cosL
    print("x = N*cos*cosL = %0.4f" %x1);

    print("2)")
    print("y = %0.4f" %y);
    y1=n*cos*sinL
    print("y = N*cos*sinL = %0.4f" %y1);

    print("3)")
    print("z = %0.4f" %z);
    z1=n*(1-e1)*sin
    print("z = N*(1-e1)*sin = %0.4f" %z1);
    print("")
    k+=1

